zhecd/robotarm_stm32f407/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define KEY_MODE_Pin GPIO_PIN_2
#define KEY_MODE_GPIO_Port GPIOE
#define KEY_MODE_EXTI_IRQn EXTI2_IRQn
#define LED0_Pin GPIO_PIN_0
#define LED0_GPIO_Port GPIOC
#define LED1_Pin GPIO_PIN_1
#define LED1_GPIO_Port GPIOC
#define LED2_Pin GPIO_PIN_2
#define LED2_GPIO_Port GPIOC
#define LED3_Pin GPIO_PIN_3
#define LED3_GPIO_Port GPIOC
#define PWM_Pin GPIO_PIN_1
#define PWM_GPIO_Port GPIOA
#define M1_STEP_Pin GPIO_PIN_6
#define M1_STEP_GPIO_Port GPIOA
#define M2_STEP_Pin GPIO_PIN_7
#define M2_STEP_GPIO_Port GPIOA
#define M3_STEP_Pin GPIO_PIN_0
#define M3_STEP_GPIO_Port GPIOB
#define PS2_DAT_Pin GPIO_PIN_12
#define PS2_DAT_GPIO_Port GPIOE
#define PS2_CMD_Pin GPIO_PIN_13
#define PS2_CMD_GPIO_Port GPIOE
#define PS2_CS_Pin GPIO_PIN_14
#define PS2_CS_GPIO_Port GPIOE
#define PS2_CLK_Pin GPIO_PIN_15
#define PS2_CLK_GPIO_Port GPIOE
#define M1_STOP_Pin GPIO_PIN_10
#define M1_STOP_GPIO_Port GPIOC
#define M1_STOP_EXTI_IRQn EXTI15_10_IRQn
#define M2_STOP_Pin GPIO_PIN_11
#define M2_STOP_GPIO_Port GPIOC
#define M2_STOP_EXTI_IRQn EXTI15_10_IRQn
#define M3_STOP_Pin GPIO_PIN_12
#define M3_STOP_GPIO_Port GPIOC
#define M3_STOP_EXTI_IRQn EXTI15_10_IRQn
#define EN_Pin GPIO_PIN_2
#define EN_GPIO_Port GPIOD
#define M1_DIR_Pin GPIO_PIN_3
#define M1_DIR_GPIO_Port GPIOD
#define M2_DIR_Pin GPIO_PIN_4
#define M2_DIR_GPIO_Port GPIOD
#define M3_DIR_Pin GPIO_PIN_5
#define M3_DIR_GPIO_Port GPIOD

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
